apache/nuttx/arch/risc-v/src/esp32c3/esp_ble_adapter.c
          /* set default bluetooth sleep clock cycle and its
           * fractional bits
           */

          g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
          g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);

          /* External 32 kHz XTAL */

          if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_EXT_32K_XTAL)
            {
              /* check whether or not EXT_CRYS is working */

              if (rtc_clk_slow_freq_get() !=
                  SOC_RTC_SLOW_CLK_SRC_XTAL32K)
                {
                  wlwarn("32.768kHz XTAL not detected, fall back to main"
                         "XTAL as Bluetooth sleep clock");
                  g_lp_cntl.lpclk_sel = ESP_BT_SLEEP_CLOCK_MAIN_XTAL;
#if !CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
                  g_lp_cntl.no_light_sleep = 1;
#endif
                }
            }
          else if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_RTC_SLOW)
            {
              /* Internal 136kHz RC oscillator */

              if (rtc_clk_slow_freq_get() ==
                  SOC_RTC_SLOW_CLK_SRC_RC_SLOW)
                {
                  wlwarn("Internal 136kHz RC oscillator. The accuracy of "
                         "this clock is a lot larger than 500ppm which is "
                         "required in Bluetooth communication, so don't "
                         "select this option in scenarios such as BLE "
                         "connection state.");
                }
              else
                {
                  wlwarn("Internal 136kHz RC oscillator not detected.");
                  PANIC();
                }
            }
          else if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL)
            {
              wlinfo("Bluetooth will use main XTAL as sleep clock.");
  #if !CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
              g_lp_cntl.no_light_sleep = 1;
  #endif
            }
        }
      else
        {
          g_lp_cntl.no_light_sleep = 1;
        }

      if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL)
        {
#ifdef CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
          esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_ON);
          g_lp_cntl.main_xtal_pu = 1;
#endif
          select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL);
          set_div_ret = btdm_lpclk_set_div(esp_clk_xtal_freq() / MHZ);
          assert(select_src_ret && set_div_ret);
          g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
          g_btdm_lpcycle_us = 1 << (g_btdm_lpcycle_us_frac);
        }
      else if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_EXT_32K_XTAL)
        {
          select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL32K);
          set_div_ret = btdm_lpclk_set_div(0);
          assert(select_src_ret && set_div_ret);
          g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
          g_btdm_lpcycle_us = (RTC_CLK_CAL_FRACT > 15) ?
                              (1000000 << (RTC_CLK_CAL_FRACT - 15)) :
                              (1000000 >> (15 - RTC_CLK_CAL_FRACT));
          assert(g_btdm_lpcycle_us != 0);
        }
      else if (g_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_RTC_SLOW)
        {
          select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
          set_div_ret = btdm_lpclk_set_div(0);
          assert(select_src_ret && set_div_ret);
          g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
          g_btdm_lpcycle_us = esp_clk_slowclk_cal_get();
        }
      else
        {
          UNUSED(select_src_ret);
          UNUSED(set_div_ret);
          err = ESP_ERR_INVALID_ARG;
          break;
        }

#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
      coex_update_lpclk_interval();
#endif

#ifdef CONFIG_PM
      if (g_lp_cntl.no_light_sleep)
        {
          err = esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0,
                                   "ble", &g_light_sleep_pm_lock);
          if (err != OK)
            {
              break;
            }

          wlwarn("Light sleep mode will not be able to"
                  "apply when bluetooth is enabled.");
        }

      err = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "ble", &g_pm_lock);
      if (err != OK)
        {
          break;
        }
      else
        {
          g_lp_stat.pm_lock_released = 1;
        }
#endif
    }
  while (0);

  return err;
}

/****************************************************************************
 * Name: btdm_controller_mem_init
 *
 * Description:
 *   Initialize BT controller to allocate task and other resource.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_controller_mem_init(void)
{
  extern void btdm_controller_rom_data_init(void);
  btdm_controller_rom_data_init();
}

/****************************************************************************
 * Name: bt_controller_deinit_internal
 *
 * Description:
 *   Deinit BT internal controller.
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *    None
 *
 ****************************************************************************/

static void bt_controller_deinit_internal(void)
{
  periph_module_disable(PERIPH_BT_MODULE);

  btdm_low_power_mode_deinit();

  esp_bt_power_domain_off();
#if CONFIG_MAC_BB_PD
  esp_mac_bb_pd_mem_deinit();
#endif
  esp_phy_modem_deinit();

  if (g_osi_funcs_p != NULL)
    {
    free(g_osi_funcs_p);
    g_osi_funcs_p = NULL;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;
}

/****************************************************************************
 * Name: btdm_low_power_mode_deinit
 *
 * Description:
 *   This function deinitializes the low power control resources. It checks
 *   various conditions and if they are met, it performs the corresponding
 *   deinitialization actions such as stopping and deleting timers,
 *   deregistering tasks, deleting semaphores, and updating the low power
 *   clock interval.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_low_power_mode_deinit(void)
{
#if CONFIG_MAC_BB_PD
  if (g_lp_cntl.mac_bb_pd)
    {
      btdm_deep_sleep_mem_deinit();
      g_lp_cntl.mac_bb_pd = 0;
    }
#endif

